Revit 2016 API
Mesh Class
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public class Mesh : GeometryObject
Visual Basic
Public Class Mesh _
	Inherits GeometryObject
Visual C++
public ref class Mesh : public GeometryObject
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Mesh
See Also
Mesh Members
Autodesk.Revit.DB Namespace